In [2]:
import sys

import numpy as np
import pandas as pd
import s3fs

sys.path.append("/Users/fgu/dev/projects/mdb_eval")
import src.helpers.io as io
import src.helpers.data as hd
import src.data.aggregators as agg
import src.data.selectors as sl

fs = s3fs.S3FileSystem(profile="3di")

pd.set_option("display.max_rows", 120)
pd.set_option("display.max_columns", 120)
pd.set_option("max_colwidth", None)
%load_ext autoreload
%autoreload 2

In [3]:
fs.ls('s3://3di-data-mdb/clean')

['3di-data-mdb/clean/',
 '3di-data-mdb/clean/mdb_000.parquet',
 '3di-data-mdb/clean/mdb_111.parquet',
 '3di-data-mdb/clean/mdb_777.parquet',
 '3di-data-mdb/clean/mdb_X11.parquet',
 '3di-data-mdb/clean/mdb_X77.parquet',
 '3di-data-mdb/clean/mdb_costa.parquet',
 '3di-data-mdb/clean/pieces',
 '3di-data-mdb/clean/samples']

## Txn data

In [4]:
dft = hd.read_txn_data('111')
hd.inspect(dft)

Time for read_txn_data                 : 1.87 minutes
shape: (593,133, 35), users: 270

,date,user_id,amount,desc,merchant,tag_group,tag_spend,user_registration_date,account_created,account_id,account_last_refreshed,account_provider,account_type,birth_year,data_warehouse_date_created,data_warehouse_date_last_updated,id,is_debit,is_female,is_sa_flow,is_salary_pmt,is_urban,latest_balance,lsoa,merchant_business_line,msoa,postcode,region_name,salary_range,tag,tag_auto,tag_manual,tag_up,updated_flag,ym
0,2012-01-03,111,-114.0,<mdbremoved>,NaN,NaN,NaN,2010-06-19,2016-10-30,235634,2018-08-08 10:24:00,lloyds bank,current,NaN,2014-07-18,2015-03-19,397323,False,0.0,False,False,1.0,0.5,e01001036,NaN,e02000222,cr2 7,london,,NaN,NaN,no tag,no tag,u,2012-01
1,2012-01-03,111,8.5,<mdbremoved>,NaN,NaN,NaN,2010-06-19,2016-10-30,235634,2018-08-08 10:24:00,lloyds bank,current,NaN,2014-07-18,2015-03-19,397324,True,0.0,False,False,1.0,0.5,e01001036,NaN,e02000222,cr2 7,london,,NaN,NaN,no tag,no tag,u,2012-01

In [5]:
dfa = hd.read_analysis_data('XX1')
hd.inspect(dfa)

Time for read_analysis_data            : 1.38 seconds
shape: (82,860, 23), users: 2506

,user_id,ym,ymn,txns_count,txns_volume,month_income,inflows,outflows,netflows,netflows_norm,inflows_norm,outflows_norm,has_pos_netflows,pos_netflows_norm,t,month_spend,pct_credit,age,is_female,region_name,is_urban,has_sa_account,generation
0,121,2017-02,201702,8,100564.921875,605.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0.0,1,537.169983,0.0,30.0,0.0,south east,1.0,True,Gen X
1,121,2017-03,201703,23,14438.519531,605.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0.0,1,3314.290039,0.0,30.0,0.0,south east,1.0,True,Gen X

## txn data dev

In [53]:
k = agg.has_sa_account(dft).to_frame().reset_index()
k

Time for has_sa_account                : 0.04 seconds

      user_id       ym  has_sa_account
0         111  2012-01            True
1         111  2012-02            True
2         111  2012-03            True
3         111  2012-04            True
4         111  2012-05            True
...       ...      ...             ...
7298   589111  2020-03            True
7299   589111  2020-04            True
7300   589111  2020-05            True
7301   589111  2020-06            True
7302   589111  2020-07            True

[7303 rows x 3 columns]